Revit 2027 API
BuiltInFailures.RebarSystemFailures.AreaReinforcementWrongHost Property
 Area Reinforcement can be placed only in Structural Floors and straight Structural Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaReinforcementWrongHost { get; }
Public Shared ReadOnly Property AreaReinforcementWrongHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaReinforcementWrongHost {
	FailureDefinitionId^ get ();
}
static member AreaReinforcementWrongHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace